app/Controllers/Home.php

INSERT INTO `tb_pessoas` (`nome`, `profissao`, `idade`) VALUES ('Pedro', 'Programador', '17')
---
    public function gravar(){
        $model = new PessoasModel();

        $model->save([
            'id'        =>  $this->request->getVar('id'),
            'nome'      =>  $this->request->getVar('nome'),
            'profissao' =>  $this->request->getVar('profissao'),
            'idade'     =>  $this->request->getVar('idade'),
        ]);

DELETE FROM `tb_pessoas`
WHERE `id` IN ('1')
---
    public function excluir($id = null){
        $model = new PessoasModel();
        $model->delete($id);